{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>ANTA Sports Products Ltd</th>\n",
       "      <th>Al Hammadi Development and Investment Co</th>\n",
       "      <th>Al Rajhi Bank</th>\n",
       "      <th>AngloGold Ashanti Ltd</th>\n",
       "      <th>Banco do Brasil SA</th>\n",
       "      <th>Bank Al-Jazira</th>\n",
       "      <th>Bank of China Ltd</th>\n",
       "      <th>China Literature Ltd</th>\n",
       "      <th>China Mengniu Dairy Co Ltd</th>\n",
       "      <th>...</th>\n",
       "      <th>TCS Group Holding PLC</th>\n",
       "      <th>Turk Telekomunikasyon AS</th>\n",
       "      <th>TurkDEX ISE 30 Futures</th>\n",
       "      <th>Turkcell Iletisim Hizmetleri AS</th>\n",
       "      <th>Turkiye Sise ve Cam Fabrikalari AS</th>\n",
       "      <th>UNITED STATES GOVERNMENT</th>\n",
       "      <th>Union National Bank PJSC</th>\n",
       "      <th>Wuliangye Yibin Co Ltd</th>\n",
       "      <th>Yanbu National Petrochemical Co</th>\n",
       "      <th>Yandex NV</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ANTA Sports Products Ltd</td>\n",
       "      <td>0.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>...</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.50</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Al Hammadi Development and Investment Co</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>...</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.50</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Al Rajhi Bank</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>...</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.50</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AngloGold Ashanti Ltd</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>...</td>\n",
       "      <td>0.50</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.25</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Banco do Brasil SA</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>0.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>...</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.50</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>1.00</td>\n",
       "      <td>0.75</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 60 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 Unnamed: 0  ANTA Sports Products Ltd  \\\n",
       "0                  ANTA Sports Products Ltd                      0.00   \n",
       "1  Al Hammadi Development and Investment Co                      1.00   \n",
       "2                             Al Rajhi Bank                      1.00   \n",
       "3                     AngloGold Ashanti Ltd                      0.75   \n",
       "4                        Banco do Brasil SA                      1.00   \n",
       "\n",
       "   Al Hammadi Development and Investment Co  Al Rajhi Bank  \\\n",
       "0                                      1.00           1.00   \n",
       "1                                      0.00           1.00   \n",
       "2                                      1.00           0.00   \n",
       "3                                      0.75           0.75   \n",
       "4                                      1.00           1.00   \n",
       "\n",
       "   AngloGold Ashanti Ltd  Banco do Brasil SA  Bank Al-Jazira  \\\n",
       "0                   0.75                1.00            1.00   \n",
       "1                   0.75                1.00            1.00   \n",
       "2                   0.75                1.00            1.00   \n",
       "3                   0.00                0.75            0.75   \n",
       "4                   0.75                0.00            1.00   \n",
       "\n",
       "   Bank of China Ltd  China Literature Ltd  China Mengniu Dairy Co Ltd  \\\n",
       "0               1.00                  1.00                        1.00   \n",
       "1               1.00                  1.00                        1.00   \n",
       "2               1.00                  1.00                        1.00   \n",
       "3               0.75                  0.75                        0.75   \n",
       "4               1.00                  1.00                        1.00   \n",
       "\n",
       "     ...      TCS Group Holding PLC  Turk Telekomunikasyon AS  \\\n",
       "0    ...                       0.75                      1.00   \n",
       "1    ...                       0.75                      1.00   \n",
       "2    ...                       0.75                      1.00   \n",
       "3    ...                       0.50                      0.75   \n",
       "4    ...                       0.75                      1.00   \n",
       "\n",
       "   TurkDEX ISE 30 Futures  Turkcell Iletisim Hizmetleri AS  \\\n",
       "0                    0.50                             1.00   \n",
       "1                    0.50                             1.00   \n",
       "2                    0.50                             1.00   \n",
       "3                    0.25                             0.75   \n",
       "4                    0.50                             1.00   \n",
       "\n",
       "   Turkiye Sise ve Cam Fabrikalari AS  UNITED STATES GOVERNMENT  \\\n",
       "0                                1.00                      0.75   \n",
       "1                                1.00                      0.75   \n",
       "2                                1.00                      0.75   \n",
       "3                                0.75                      1.00   \n",
       "4                                1.00                      0.75   \n",
       "\n",
       "   Union National Bank PJSC  Wuliangye Yibin Co Ltd  \\\n",
       "0                      1.00                    1.00   \n",
       "1                      1.00                    1.00   \n",
       "2                      1.00                    1.00   \n",
       "3                      0.75                    0.75   \n",
       "4                      1.00                    1.00   \n",
       "\n",
       "   Yanbu National Petrochemical Co  Yandex NV  \n",
       "0                             1.00       0.75  \n",
       "1                             1.00       0.75  \n",
       "2                             1.00       0.75  \n",
       "3                             0.75       1.00  \n",
       "4                             1.00       0.75  \n",
       "\n",
       "[5 rows x 60 columns]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://127.0.0.1:7687\",auth=basic_auth(\"neo4j\", \"boula1994\"))\n",
    "session = driver.session()\n",
    "\n",
    "df = pd.read_csv(\"A.csv\")\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'AngloGold Ashanti Ltd'"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[3][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [],
   "source": [
    "x = len(df.index)\n",
    "\n",
    "# def add_person(self, name):\n",
    "#     with self._driver.session() as session:\n",
    "#         session.run(\"CREATE (a:Person {name: $name})\", name=name)\n",
    "\n",
    "for c in df[\"Unnamed: 0\"]:\n",
    "     session.run(\"create (:\" + c.replace(\" \",\"\").replace(\"-\",\"\").replace(\"&\",\"\") + \")\")\n",
    "\n",
    "for i in range(x):\n",
    "    for j in range(x):\n",
    "          if(df.iloc[i][j+1]  != 0 ):\n",
    "                session.run(\"MATCH (a),(b) WHERE a = '\" + df.iloc[i][0] + \"' AND b = '\" + df.iloc[j][0] \n",
    "                            + \"' CREATE (a)-[r:RELTYPE]->(b) RETURN r\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = session.run(\"MATCH (a),(b) WHERE a = '\" + df.iloc[i][0] + \"' AND b = '\" + df.iloc[j][0] \n",
    "                            + \"' CREATE (a)-[r:RELTYPE]->(b) RETURN r\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.v1.result.BoltStatementResult object at 0x10e9150f0>\n"
     ]
    }
   ],
   "source": [
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result.summary()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "print(result.summary())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
